Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Generation options for javadoc not specified
zh_cn: 未指定 javadoc 的生成选项

source: Generic array creation
zh_cn: 泛型数组创建

source: Generic class may not extend 'java.lang.Throwable'
zh_cn: 泛型类不能继承 'java.lang.Throwable'

source: Generics
zh_cn: 泛型

source: Generics in qualifier reference may cause compilation error in some Javac versions (e.g. JDK 5 and JDK 6).
zh_cn: 限定符引用中的泛型可能会导致某些 Javac 版本(例如 JDK 5和 JDK 6)中的编译错误。

source: Generify
zh_cn: 泛型

source: Generify &Objects
zh_cn: 泛型对象(&O)

source: Generify File
zh_cn: 生成文件

source: Get
zh_cn: 获取

source: Get Changelist
zh_cn: 获取更改列表

source: Get Revision
zh_cn: 获取修订版本

source: Get Revision Content
zh_cn: 得到修订内容

source: Get Version
zh_cn: 获取版本

source: Get familiar with the main features of the IDE by reading these tips.
zh_cn: 阅读这些提示，熟悉 IDE 的主要功能。

source: Get latest version of files modified in selected changelist
zh_cn: 获取在选中更改列表中文件的最新版本的修改

source: Get started developing plugins for {0}.
zh_cn: 开始开发 {0} 的插件。

source: Get started developing plugins.
zh_cn: 开始开发插件。

source: Get version from repository
zh_cn: 从仓库获取版本

source: Getter and Setter
zh_cn: Getter 和 Setter

source: Getter and setter methods found for the field {0}.
zh_cn: 找到字段 {0} 的 Getter 和 setter 方法。

source: Getter for @{0} field is annotated @{1}
zh_cn: @{0} 字段的 getter 注解为 @{1}

source: Getter for @{0} field might be annotated @{0} itself
zh_cn: @{0} 字段的 getter 可能被注解为 @{0}

source: Getter method found for the field {0}.
zh_cn: 找到字段 {0} 的 getter 方法。

source: Getting revisions content
zh_cn: 获取修订内容

source: Global
zh_cn: 全局

source: Global Code Style
zh_cn: 全局 代码样式

source: Global Libraries
zh_cn: 全局库

source: Global Library
zh_cn: 全局库

source: Global code style settings can be configured<br>in IDE Settings/Global Code Style</body></html>
zh_cn: 全局代码样式设置可以配置<br>在 IDE 设置/全局代码样式</body></html>

source: Global libraries
zh_cn: 全局库

source: Global method name code completion
zh_cn: 全局方法名代码补全

source: Global {0, choice, 1#Library|2#Libraries}
zh_cn: 全局库

source: Go Next Problem
zh_cn: 转到下一个问题

source: Go Prev Problem
zh_cn: 转到上一个问题

source: Go To
zh_cn: 转到

source: Go To Changed File...
zh_cn: 转到更改的文件...

source: Go To Class action is not available until indices are built, using Go To File instead
zh_cn: 在建立索引之前，转到类操作是不可用的，请使用转到文件代替

source: Go To Editor Popup Menu Group
zh_cn: 转到编辑窗弹出菜单组

source: Go To Type action is not available until indices are built, using Go To File instead
zh_cn: 在建立索引之前，转到类操作是不可用的，请使用转到文件代替

source: Go To {0} action is not available until indices are built, using Go To File instead
zh_cn: 在建立索引之前，转到 {0} 操作是不可用的，请使用转到文件代替

source: Go to Settings | Keymap, click the Find Actions by Shortcut button, press the shortcut you know to see the name of the corresponding action, and then set a new shortcut for it.
zh_cn: 转到 Settings | Keymap，单击 Find Actions by Shortcut 按钮，按下您知道的快捷方式查看相应操作的名称，然后为其设置新的快捷方式。

source: Go to Bookmark 0
zh_cn: 转到书签 0

source: Go to Bookmark 1
zh_cn: 转到书签 1

source: Go to Bookmark 2
zh_cn: 转到书签 2

source: Go to Bookmark 3
zh_cn: 转到书签 3

source: Go to Bookmark 4
zh_cn: 转到书签 4

source: Go to Bookmark 5
zh_cn: 转到书签 5

source: Go to Bookmark 6
zh_cn: 转到书签 6

source: Go to Bookmark 7
zh_cn: 转到书签 7

source: Go to Bookmark 8
zh_cn: 转到书签 8

source: Go to Bookmark 9
zh_cn: 转到书签 9

source: Go to Custom Folding
zh_cn: 转到自定义折叠

source: Go to Desktop directory
zh_cn: 转到桌面目录

source: Go to Line
zh_cn: 转到行

source: Go to Link Target
zh_cn: 转到链接目标

source: Go to Next Code Template Tab
zh_cn: 转到下一个代码模板选项卡

source: Go to Previous Code Template Tab
zh_cn: 转到上一个代码模板选项卡

source: Go to action
zh_cn: 转到操作

source: Go to class
zh_cn: 转到类

source: Go to declaration
zh_cn: 转到声明

source: Go to duplicate
zh_cn: 转到重复

source: Go to file
zh_cn: 转到文件

source: Go to high priority problems only
zh_cn: 只转到高优先级问题

source: Go to home directory
zh_cn: 转到主目录

source: Go to implementation
zh_cn: 转到实现

source: Go to inspection
zh_cn: 转到检查

source: Go to line which caused exception when opening test source
zh_cn: 打开源码时转到引起异常的行

source: Go to module directory
zh_cn: 转到模块目录

source: Go to next call
zh_cn: 转到下一个调用

source: Go to next change
zh_cn: 转到下一个更改

source: Go to next highlighted element usage
zh_cn: 转到下一个高亮的元素用法

source: Go to next method
zh_cn: 转到下一个方法

source: Go to next problem
zh_cn: 转到下一个问题

source: Go to next split
zh_cn: 转到下一个拆分

source: Go to next type
zh_cn: 转到下一个类型

source: Go to previous call
zh_cn: 转到上一个调用

source: Go to previous change
zh_cn: 转到上一个更改

source: Go to previous highlighted element usage
zh_cn: 转到上一个高亮的元素用法

source: Go to previous method
zh_cn: 转到上一个方法

source: Go to previous split
zh_cn: 转到上一个拆分

source: Go to previous type
zh_cn: 转到上一个类型

source: Go to project directory
zh_cn: 转到项目目录

source: Go to symbol
zh_cn: 转到符号

source: Got it!
zh_cn: 知道了

source: Goto Error/Bookmark Actions
zh_cn: 转到错误/书签的操作

source: Goto Previous Splitter
zh_cn: 转到上一个分割

source: Goto by Name Actions
zh_cn: 通过名称跳转的操作

source: Goto by Reference Actions
zh_cn: 通过引用跳转的操作

source: Goto next splitter window
zh_cn: 转到下一个分割窗口

source: Goto previous splitter window
zh_cn: 转到上一个分割窗口

source: Graph
zh_cn: 图表

source: Grid
zh_cn: 网格

source: Groovy Script execution error: {0}
zh_cn: Groovy 脚本执行错误：{0}

source: Group
zh_cn: 组

source: Group By Modules
zh_cn: 按模块分组

source: Group By Packages
zh_cn: 按包分组

source: Group Configurations
zh_cn: 分组配置

source: Group Inspections By Severity
zh_cn: 检查按严重程度分组

source: Group Methods by Defining Type
zh_cn: 方法按定义类型分组

source: Group Name:
zh_cn: 组名：

source: Group Tabs
zh_cn: 组织选项卡

source: Group by
zh_cn: 要组通过

source: Group by Changelist
zh_cn: 按更改列表分组

source: Group by Directory
zh_cn: 按目录分组

source: Group by Folder
zh_cn: 按文件夹分组

source: Group by Packages
zh_cn: 按包分组

source: Group by Scope Type
zh_cn: 按范围类型分组

source: Group by Scope Type (production, test, libraries)
zh_cn: 按范围类型分组(产品,测试,类库)

source: Group by Severity
zh_cn: 按严重程度分组

source: Group by Status
zh_cn: 按状态分组

source: Group by Type
zh_cn: 按类型分组

source: Group by cl&asses
zh_cn: 用类分组(&A)

source: Group by class
zh_cn: 按类分组

source: Group by file
zh_cn: 按文件分组

source: Group by file structure
zh_cn: 按文件结构分组

source: Group by me&thods
zh_cn: 用方法分组(&T)

source: Group by module
zh_cn: 按模块分组

source: Group by package
zh_cn: 按包分组

source: Group by usage type
zh_cn: 按使用类型分组

source: Group changes by directories and modules
zh_cn: 按目录和模块对更改进行分组

source: Group declarations
zh_cn: 组声明

source: Group property field with corresponding getter/setter
zh_cn: 分组属性字段和相应的 getter/setter

source: Group:
zh_cn: 组:

source: Grouping parentheses
zh_cn: 分组括号

source: Grouping rules
zh_cn: 分组规则

source: Groups of names
zh_cn: 组名称

source: Guarded Block Modification Attempt
zh_cn: 尝试修改守护块

source: HTML 'style' attribute
zh_cn: HTML 'style' 属性

source: HTML File
zh_cn: HTML 文件

source: HTML Text
zh_cn: HTML 文本

source: HTML code
zh_cn: HTML 代码

source: HTML files
zh_cn: HTML 文件

source: HTML files will be exported to this directory
zh_cn: HTML 文件将导出至该目录

source: HTML problems in Javadoc (DocLint)
zh_cn: Javadoc 中的 HTML 问题 (DocLint)

source: HTML5 Outline
zh_cn: HTML5大纲

source: HTTP Proxy
zh_cn: HTTP 代理

source: HTTP Proxy Settings
zh_cn: HTTP 代理设置

source: HTTP Result code: {0}
zh_cn: HTTP 返回代码: {0}

source: Hard coded string literal: {0}
zh_cn: 硬编码字符串:{0}

source: Hard coded strings
zh_cn: 硬编码字符串

source: Hard wrap at
zh_cn: 硬换行在

source: Has implementations
zh_cn: 已经实现

source: Has no reachable implementation instantiations.
zh_cn: 没有可到达的实现实例。

source: Has no reachable instantiations.
zh_cn: 没有可到达的实例。

source: Has reachable implementation instantiations.
zh_cn: 有可达到的实现实例。

source: Has reachable instantiations.
zh_cn: 有可到达的实例。

source: Has subclasses
zh_cn: 有子类

source: Have changed descendants
zh_cn: 已经更改的后代

source: Have immediate changed children
zh_cn: 有立即改变的 children

source: Have you noticed the buttons marking differences in the Differences viewer?
zh_cn: 你有没有注意到按钮 在差异查看器中处理差异吗？

source: Having pressed Alt+Shift, click the left mouse button at the desired position to set additional cursors in the editor.
zh_cn: 按住 Alt+Shift ，在所需位置单击鼠标左键即可在编辑器中设置额外的光标。

source: Having pressed Alt, click the left mouse button at the desired position to set additional cursors in the editor.
zh_cn: 按住 Alt ，在所需位置单击鼠标左键即可在编辑器中设置额外的光标。

source: Header
zh_cn: 页眉

source: Header and Footer
zh_cn: 页眉和页脚

source: Help
zh_cn: 帮助

source: Help topic "{0}" not found
zh_cn: 帮助主题 "{0}" 未找到

source: Hex prefix:
zh_cn: 十六进制的前缀:

source: Hexadecimal floating point literals
zh_cn: 十六进制浮点文字

source: Hexadecimal numbers must contain at least one hexadecimal digit
zh_cn: 十六进制数字必须至少包含一个十六进制数字

source: Hi_de Active Tool Window
zh_cn: 隐藏活动工具窗口(_D)

source: Hide
zh_cn: 隐藏

source: Hide &null array elements
zh_cn: 隐藏 null 数组元素(&N)

source: Hide &null elements in arrays and collections
zh_cn: 隐藏数组和集合中的 null 元素(&N)

source: Hide All _Tool Windows
zh_cn: 隐藏所有工具窗口(_T)

source: Hide All _Windows
zh_cn: 关闭所有窗口(_W)

source: Hide Co&verage Info
zh_cn: 隐藏覆盖率信息(&V)

source: Hide Empty Middle Packages
zh_cn: 隐藏空的中间包

source: Hide Global Inspections
zh_cn: 隐藏全局检查

source: Hide Global Inspections Settings
zh_cn: 隐藏全局检查设置

source: Hide Grid
zh_cn: 隐藏网格

source: Hide Module Groups
zh_cn: 隐藏模块组

source: Hide Side
zh_cn: 隐藏边

source: Hide Side Tool Windows
zh_cn: 隐藏本侧工具窗口

source: Hide Successful setUp/tearDown
zh_cn: 隐藏成功的 setUp / tearDown

source: Hide Watches
zh_cn: 隐藏观察点

source: Hide active tool window
zh_cn: 隐藏活动工具窗口

source: Hide all tool windows
zh_cn: 隐藏所有工具窗口

source: Hide all windows on this side
zh_cn: 隐藏本侧所有窗口

source: Hide classes where the method is legally not implemented
zh_cn: 隐藏方法未合法实现的类

source: Hide debug &window on process termination
zh_cn: 在进程中止时隐藏调试窗口(&W)

source: Hide file extension in editor tabs
zh_cn: 隐藏编辑器选项卡中的文件扩展名

source: Hide merge sources
zh_cn: 隐藏合并源码

source: Hide notification
zh_cn: 隐藏通知

source: Hide path
zh_cn: 隐藏路径

source: Hide tabs if there is no space
zh_cn: 如果没有空间则隐藏选项卡

source: Hide the breadcrumbs bar
zh_cn: 隐藏面包屑导航栏

source: Hide view
zh_cn: 隐藏视图

source: Hide warnings
zh_cn: 隐藏警告

source: Hierarchic Group Layout
zh_cn: 分层的组织布局

source: Hierarchy Actions
zh_cn: 层级结构操作

source: Hierarchy of {0}
zh_cn: {0} 层次结构

source: Highlight current scope
zh_cn: 高亮当前范围

source: Highlight implementing or overriding members
zh_cn: 高亮实现或重写的成员

source: Highlight matched brace
zh_cn: 高亮匹配的括号

source: Highlight method exit points
zh_cn: 高亮方法退出点

source: Highlight method throws
zh_cn: 高亮方法抛出

source: Highlight on Caret Movement
zh_cn: 在插入符号移动时高亮

source: Highlight only transitive dependencies
zh_cn: 仅高亮传递依赖

source: Highlight usages of the symbol at caret in active editor
zh_cn: 在活动编辑器中高亮显示插入符号处符号的使用

source: Highlight:
zh_cn: 高亮:

source: Highlighting Level
zh_cn: 高亮级别

source: Highlights revisions after or equal to selected
zh_cn: 高亮显示所选之后或等于所选的修订

source: Highlights revisions before or equal to selected
zh_cn: 高亮显示所选之前或等于所选的修订

source: Highlights the file in platform's file manager
zh_cn: 在平台的文件管理器中突出显示文件

source: Hijacked
zh_cn: 劫持的

source: History for File {0}
zh_cn: 文件 {0} 的历史

source: History for {0}
zh_cn: {0} 的历史

source: History is empty
zh_cn: 历史是空的

source: Home
zh_cn: 首页

source: Home Directory
zh_cn: 主目录

source: Home directory is not specified for JDK
zh_cn: 没有为 JDK 指定主目录

source: Home page:
zh_cn: 主页:

source: Horizontal Scrolling
zh_cn: 水平滚动

source: Horizontal Toolbars
zh_cn: 水平工具栏

source: Host:
zh_cn: 主机:

source: Hot Swap
zh_cn: 热切换

source: Hot Swap completed with warnings
zh_cn: 热交换完成 带有警告

source: Hot Swap failed.
zh_cn: 热切换失败。

source: HotSwap
zh_cn: 热切换

source: Hover over the icon below to access tool windows Click the icon to make tool windows buttons visible
zh_cn: 将鼠标悬停在可访问工具窗口下面的图标上 单击图标可以使工具窗口按钮可见

source: Hover over the tab title and either press the middle mouse button or use Shift+click.
zh_cn: 将鼠标悬停在选项卡标题上，然后按鼠标中键或使用 Shift 单击。

source: Hover your mouse pointer over a warning, error stripe or just some section of source code on the scroll bar outside of the scroll box, and you will see a lens:
zh_cn: 将鼠标指针悬停在警告、错误条纹或滚动条外的滚动条上的部分源代码，您将看到一个镜头：

source: How it works
zh_cn: 它是如何工作的

source: However, source files may exist in the following output paths: {0} Compilation will proceed without clearing output directories.
zh_cn: 但是，源文件可能存在于以下输出路径中 {0} 编译将在不清除输出目录的情况下进行。

source: Html file not specified
zh_cn: 未指定 html 文件

source: Hungry Backspace
zh_cn: 饥饿退格

source: Hyperlinks//Followed
zh_cn: 超链接//跟随的

source: Hyperlinks//Reference
zh_cn: 超链接//引用

source: Hyperlinks//Unfollowed
zh_cn: 超链接//未跟随的

source: I/O error
zh_cn: I/O 错误

source: I18nize
zh_cn: 国际化

source: I18nize Hardcoded String
zh_cn: 国际化硬编码字符

source: I18nize hard coded string literal
zh_cn: 国际化硬编码字符串

source: I18nize string concatenation containing hard coded string literal
zh_cn: 国际化字符串包含硬编码字符串的连接

source: IBus prior to 1.5.11 may cause input problems.
zh_cn: 1.5.11之前的 IBus 可能会导致输入问题。

source: IBus version lower than 1.5.11 may cause input problems.
zh_cn: 低于 1.5.11 的 IBus 版本可能会导致输入问题。

source: IDE Error Occurred
zh_cn: IDE 错误发生

source: IDE Fatal Errors
zh_cn: IDE 致命错误

source: IDE Profile
zh_cn: IDE 配置文件

source: IDE Profiles
zh_cn: IDE 配置文件

source: IDE Profiles Settings
zh_cn: IDE 配置文件设置

source: IDE Scheme Name:
zh_cn: IDE 方案名称：

source: IDE Scripting Console
zh_cn: IDE 脚本控制台

source: IDE Settings
zh_cn: IDE 设置

source: IDE and Plugin Updates
zh_cn: IDE 和插件更新

source: IDE launcher script (idea.sh) is outdated.
zh_cn: IDE 启动器脚本(idea.sh)已过时。

source: IDE updates are managed externally by {0}
zh_cn: IDE 更新由 {0} 外部管理

source: IDE''s Java runtime ({0}) is outdated - this may cause stability issues.
zh_cn: IDE 的 Java 运行环境 ({0}) 已经过时了 - 这可能会导致稳定性问题。

source: IDE''s Java runtime ({0}) may cause instability.
zh_cn: IDE 的 Java 运行环境 ({0}) 可能会导致不稳定。

source: IDE''s Java runtime ({0}), which may cause instability.
zh_cn: IDE 的 Java 运行环境 ({0}) ，可能会导致不稳定。

source: IDEA (4.5 default)
zh_cn: IDEA (4.5 默认)

source: IDEA module
zh_cn: IDEA 模块

source: IDEA project
zh_cn: IDEA 项目

source: IDEA workspace
zh_cn: IDEA 工作工间

source: INFORMATION
zh_cn: 信息

source: INVALID
zh_cn: 无效

source: IO Error: {0}
zh_cn: IO 错误: {0}

source: IRB Output
zh_cn: IRB 输出

source: ITN returns wrong data
zh_cn: ITN 返回错误的数据

source: I_mplementation(s)
zh_cn: 实现(_M)

source: I_nline...
zh_cn: 内联...(_N)

source: Icon
zh_cn: 图标

source: Icon is too big to appear in menu
zh_cn: 图标太大，无法显示在菜单中

source: Icon size is invalid
zh_cn: 图标大小无效

source: Icon:
zh_cn: 图标:

source: Idea Module
zh_cn: Idea 模块

source: Idea Project
zh_cn: Idea 项目

source: Idea Workspace
zh_cn: Idea 工作区

source: Idempotent loop body
zh_cn: Idempotent 循环体

source: Identifier expected
zh_cn: 期望标识符

source: Identifier expected instead of ''{0}''
zh_cn: 预期标识符，而不是 ''{0}''

source: Identifier or '*' expected
zh_cn: 期望标识符或 '*'

source: Identifier or type expected
zh_cn: 期望标识符或类型

source: Identifiers//Constant
zh_cn: 标识符//常量

source: Identifiers//Default
zh_cn: 标识符//默认

source: Identifiers//Function call
zh_cn: 标识符//函数调用

source: Identifiers//Function declaration
zh_cn: 标识符//函数声明

source: Identifiers//Global variable
zh_cn: 标识符//全局变量

source: Identifiers//Label
zh_cn: 标识符//标签

source: Identifiers//Local variable
zh_cn: 标识符//局部变量

source: Identifiers//Parameter
zh_cn: 标识符//参数

source: Identifiers//Predefined symbol
zh_cn: 标识符//预定义符号

source: If a loaded module depends on an unloaded module it may lead to compilations errors.
zh_cn: 如果一个加载的模块依赖于卸载的模块可能会导致编译错误。

source: If a method signature has been changed, &productName; highlights the tags that ran out of sync with the documentation comment and suggests a quick fix:
zh_cn: 如果方法签名已更改，&productName; 会高亮与文档注释不同步的标签，并给出快速修复的建议：

source: If a method signature has been changed, IntelliJ IDEA highlights the tags that ran out of sync with the documentation comment and suggests a quick fix:
zh_cn: 如果方法签名已更改，&productName; 会高亮与文档注释不同步的标签，并给出快速修复的建议：

source: If an edge between model nodes in your Model Dependency diagram corresponds to a many-to-many, or a one-to-many association, RubyMine shows multiplicities for such an edge, and suggests you to choose which part of the association should be navigated to.
zh_cn: 如果模型依赖关系图中模型节点之间的边对应于多对多关联或一对多关联，那么 RubyMine 将显示此类边的多重性，并建议您选择关联的哪个部分应该导航至。

source: If disabled, use "{0}" to show/hide tooltips
zh_cn: 如果禁用，使用“{0}“显示/隐藏提示

source: If enabled build process will wait for debug connections when started
zh_cn: 如果启用构建过程将在启动时等待调试连接

source: If it turns red, then you have to look for a mistake.
zh_cn: 如果变成红色，那么你必须寻找一下有什么错误。

source: If necessary, you can always return the file to its original type using the Mark as <file type> context menu command.
zh_cn: 如果需要，你总是可以在上下文菜单命令中使用 Mark as <file type> 恢复文件的原始类型。

source: If necessary, you can show the tool window buttons just for a moment.
zh_cn: 如有必要，您可以临时显示工具窗口按钮。

source: If none of the applicable predefined File Watchers is associated with the current project, PhpStorm suggests to add one.
zh_cn: 如果没有适用的预定义文件查看器与当前项目关联，PhpStorm 会建议添加一个。

source: If none of the applicable predefined File Watchers is associated with the current project, RubyMine suggests to add one.
zh_cn: 如果没有适用的预定义文件查看器与当前项目关联，RubyMine 会建议添加一个。

source: If none of the applicable predefined File Watchers is associated with the current project, WebStorm suggests to add one.
zh_cn: 如果没有适用的预定义文件查看器与当前项目关联，WebStorm 会建议添加一个。

source: If not already imported
zh_cn: 如果尚未导入

source: If not specified, files and directories inherit encoding settings from the parent directory or from the Project Encoding.</html>
zh_cn: 如果未指定，文件和目录将继承父目录或 Project Encoding 的编码设置。</html>

source: If nothing is selected in the editor, and you press &shortcut:$Copy;, then the whole line at caret is copied to the clipboard.
zh_cn: 如果编辑器中没有选中的话，按 &shortcut:$Copy; 会把插入符号处的整行复制到剪贴板中。

source: If primary font fails, IDE tries to use the secondary one
zh_cn: 如果主字体无效，IDE 将尝试使用次要字体

source: If the background turns green, you are lucky.
zh_cn: 如果背景变绿，你很幸运，说明校验通过。

source: If the class is not imported yet, the import statement is generated automatically.
zh_cn: 如果类尚未导入，则会自动生成导入语句。

source: If the cursor is between the parentheses of a method call, pressing &shortcut:ParameterInfo; brings up a list of valid parameters.
zh_cn: 如果光标位于一个方法调用的括号之间，按 &shortcut:ParameterInfo; 带来一系列有效的参数。

source: If the desired group does not yet exist, create it.
zh_cn: 如果所需的组不存在，请创建它。

source: If the import statement refers to the package that is not installed locally, the IDE highlights it with an error.
zh_cn: 如果导入语句引用了本地未安装的软件包，则 IDE 将突出显示该错误。

source: If the lens annoys you, get rid of it by clearing the check box on the context menu of the code analysis marker:
zh_cn: 如果镜头惹恼你，可以通过清除代码分析标记的上下文菜单的复选框摆脱它：

source: If the list of Rails generators seems incomplete, choose Tools | Run Rails Generators in the main menu, or press &shortcut:org.jetbrains.plugins.ruby.rails.actions.generators.GeneratorsPopupAction;.
zh_cn: 如果 Rails 生成器的列表看起来不完整，请选择 Tools | Run Rails Generators，或按 &shortcut:org.jetbrains.plugins.ruby.rails.actions.generators.GeneratorsPopupAction;。

source: If the namespace is not declared yet the declaration is generated automatically.
zh_cn: 如果该命名空间还未申明，则会自动生成声明。

source: If the selected {0, choice, 1#module|2#modules} become unloaded it may cause compilations errors in the dependent modules.
zh_cn: 如果所选模块成为卸载的，它可能在依赖它的模块中导致编译错误。

source: If there are too many breakpoints in your application, ease the search by giving them names.
zh_cn: 如果应用程序中的断点太多，请通过提供名称来简化搜索。

source: If there are too many run/debug configurations of the same type, you can group them into folders, and thus distinguish them visually.
zh_cn: 如果有太多相同类型的运行调试配置，可以将它们分组到文件夹中，从而可视化地区分它们。

source: If there is an injection of some language in your code, you can edit it in a dedicated editor.
zh_cn: 如果在代码中注入某种语言，则可以在专用编辑器中进行编辑。

source: If there's an injection of some language in your code, you can edit it in a dedicated editor.
zh_cn: 如果在代码中注入某种语言，则可以在专用编辑器中进行编辑。

source: If you are going to use Django live templates, make sure that Django is selected as the default Python template language in the Settings / Preferences dialog:
zh_cn: 如果你想要使用 Django 代码模板，请确保在 Settings / Preferences 对话框中把 Django 选为默认 Python 模板语言：

source: If you are sharing project with your team, please use Project libraries instead.<br><br>Expand the node and select child items to manage Global libraries.
zh_cn: 如果您与团队共享项目，请改用项目库。<br><br>展开节点并选择子项以管理全局库。

source: If you are working on a large project, with numerous TODO items, filter them by scopes.
zh_cn: 如果您工作于大型项目，有许多 TODO 项目，请通过范围过滤他们。

source: If you are working with a partial declaration, use the corresponding gutter icon to view the list of other parts of the same declaration, and to navigate to them.
zh_cn: 如果您正在使用部分声明，请使用相应的 gutter 图标查看同一声明的其他部分的列表并导航到它们。

source: If you choose Default Branch, you'll be able to specify the strategy per branch in the branch.<name> section of the .git/config configuration file.
zh_cn: 如果您选择 Default Branch，您可以在 .git/config 配置文件中的 branch.<name> 部分为每个分支配置策略。

source: If you click the Go to view for the action gutter on an Action that has no View, the appropriate View can be created instantly.
zh_cn: 如果您单击 Go to view for the action gutter，则可立即创建适当的 View。

source: If you close the dialog, you can always get back to it from the Help | Tip of the Day main menu item.
zh_cn: 如果你关闭了对话框，你总是可以在主菜单中的 Help | Tip of the Day 找回它。

source: If you close the dialog, you can always get back to it using Help | Tip of the Day in the main menu.
zh_cn: 如果你关闭了对话框，你总是可以使用主菜单中的 Help | Tip of the Day 找回它。

source: If you close the dialog, you can always get back to it using Help | Tip of the Day on the menu bar.
zh_cn: 如果你关闭了对话框，你总是可以使用主菜单中的 Help | Tip of the Day 找回它。

source: If you continue, they will be shown in a separate Find tab.
zh_cn: 如果继续，它们将显示在单独的“查找”选项卡中。

source: If you don't like a list of members to autopopup after you type a dot, you may turn it off in the "Editor" options (Options | IDE Settings).
zh_cn: 如果您在键入点后不喜欢自动弹窗的成员列表，你可以在 "Editor" 选项中将它关闭 (Options | IDE Settings)。

source: If you don't like the default shortcuts, go to Settings | Keymap to change the shortcut for a particular action or customize the whole keymap.
zh_cn: 如果您不喜欢默认快捷键，请转到 Settings | Keymap 更改特定操作的快捷方式或自定义整个键盘映射。

source: If you don't want the "lightbulb" icon to appear in the editor to indicate a particular fix, open the list of available actions by pressing &shortcut:ShowIntentionActions; and toggle the lightbulb icon near the text of the action into inactive state by clicking it with the mouse.
zh_cn: 如果您不希望编辑器中出现 "灯泡" 图标来指示特定修复，请按 &shortcut:ShowIntentionActions; 打开可用操作列表，然后通过用鼠标点击操作文本旁边的灯泡按钮来切换为未激活状态。

source: If you don't want to commit some of your changes to the repository, you can set them aside for a while, by moving to a separate changelist, or by putting them to a shelf.
zh_cn: 如果您不想将某些更改提交到存储库，通过移动到单独的更改列表或将它们放到 shelf，你可以将它们暂放到一边。

source: If you have already spent some time working in the interactive consoles, you don't need to re-type the previously entered commands to repeat them.
zh_cn: 如果您已经在交互式控制台上工作了一段时间，则不需要重新键入以前输入的命令来重复它们。

source: If you have created a Rake task and still can't see it in the list, choose Tools | Run Rake Task in the main menu, or press &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction;.
zh_cn: 如果您创建了 Rake 任务并仍然无法在列表中看到它，请选择 Tools | Run Rake Task，或者按 &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction;。

source: If you keep Shift pressed, the chevrons turn into .
zh_cn: 如果按住 Shift ， chevrons 变为 。

source: If you lack words in the pre-defined dictionaries, you can create your own ones.
zh_cn: 如果您在预定义的字典中缺少单词，您可以创建自己的字典。

source: If you need more workspace, you can hide the tool windows bars: click in the lower left corner.
zh_cn: 如果您需要更多的工作区，您可以通过点击左下角的 来隐藏工具窗口栏。
